# A multiple indexed series

In [154]:
import pandas as pd
import numpy as np

## The bad way

In [155]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index = index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [156]:
pop[('California', 2010) : ('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [157]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

## The better way : pandas multiindex

In [158]:
index = pd.MultiIndex.from_tuples(index)
# index now is a multiindex extracted 
# from its past version
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [159]:
pop = pop.reindex(index)
# reindexing pop with new index
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [160]:
pop[:, 2010]
# getting any info from 2010

California    37253956
New York      19378102
Texas         25145561
dtype: int64

## MultiIndex as extra dimension

In [161]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [162]:
pop_df = pd.DataFrame({'total' : pop,
                       'under18' : [9267089, 9284094,
                                    4687374, 4318033,
                                    5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [163]:
f_u18 = pop_df['total'] - pop_df['under18']
f_u18

California  2000    24604559
            2010    27969862
New York    2000    14289083
            2010    15060069
Texas       2000    14945519
            2010    18266547
dtype: int64

In [164]:
f_u18.unstack()

                2000      2010
California  24604559  27969862
New York    14289083  15060069
Texas       14945519  18266547

# Methods of MUltiINdex Creation

In [165]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns = ['data1', 'data2'])
# here, index is composed by two vector
df

        data1     data2
a 1  0.924301  0.730732
  2  0.501154  0.366799
b 1  0.115522  0.648402
  2  0.863271  0.967724

In [166]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
# here, we set a tuple-type index and associate 
# each one with a value
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [167]:
pd.Series(data)['California']

2000    33871648
2010    37253956
dtype: int64

## Explicit MultiIndex constructors

In [168]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [169]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [170]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

## MultiIndex level names

In [171]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## MultiIndex for columns

In [172]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names = ['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names = ['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      55.0  37.8  42.0  36.4  42.0  37.8
     2      34.0  36.6  37.0  36.2  39.0  36.4
2014 1      29.0  37.1  42.0  35.5  32.0  37.4
     2      63.0  37.3  44.0  35.4  29.0  36.3

In [173]:
index

MultiIndex([(2013, 1),
            (2013, 2),
            (2014, 1),
            (2014, 2)],
           names=['year', 'visit'])

In [174]:
columns

MultiIndex([(  'Bob',   'HR'),
            (  'Bob', 'Temp'),
            ('Guido',   'HR'),
            ('Guido', 'Temp'),
            (  'Sue',   'HR'),
            (  'Sue', 'Temp')],
           names=['subject', 'type'])

In [175]:
health_data.loc[2013]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
1        55.0  37.8  42.0  36.4  42.0  37.8
2        34.0  36.6  37.0  36.2  39.0  36.4

In [176]:
health_data.loc[2014]

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR  Temp
visit
1        29.0  37.1  42.0  35.5  32.0  37.4
2        63.0  37.3  44.0  35.4  29.0  36.3

# Indexing and Slicing a MultiIndex

## Multiply indexed Series

In [177]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [178]:
pop['California', 2000]

np.int64(33871648)

In [179]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [180]:
pop.loc['California' : 'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [181]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

## Multiply indexed DataFrames

In [182]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      55.0  37.8  42.0  36.4  42.0  37.8
     2      34.0  36.6  37.0  36.2  39.0  36.4
2014 1      29.0  37.1  42.0  35.5  32.0  37.4
     2      63.0  37.3  44.0  35.4  29.0  36.3

In [183]:
health_data['Guido', 'HR']

year  visit
2013  1        42.0
      2        37.0
2014  1        42.0
      2        44.0
Name: (Guido, HR), dtype: float64

In [184]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      55.0  37.8
     2      34.0  36.6

In [185]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        55.0
      2        34.0
2014  1        29.0
      2        63.0
Name: (Bob, HR), dtype: float64

In [186]:
# if you want, for example, to find the HR info of all
# patients in their first visits of each year, you
# cannot do:
# health_data.loc[(:, 1), (:, 'HR')]
# so we use IndexSlice, which is built precisely for
# this context

idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      55.0  42.0  42.0
2014 1      29.0  42.0  32.0

# Rearranging Multi-Indices

## Sorted and unsorted indices

In [187]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index = index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.585204
      2      0.800463
c     1      0.438624
      2      0.379062
b     1      0.054307
      2      0.492774
dtype: float64

In [188]:
# data['a':'b']
# Although it is not entirely clear from the error message,
# this is the result of the MultiIndex not being sorted.
# For various reasons, partial slices and other similar
# operations require the levels in the MultiIndex to be in
# sorted (i.e., lexographical) order.

data = data.sort_index()
data

char  int
a     1      0.585204
      2      0.800463
b     1      0.054307
      2      0.492774
c     1      0.438624
      2      0.379062
dtype: float64

In [189]:
data['a':'b']

char  int
a     1      0.585204
      2      0.800463
b     1      0.054307
      2      0.492774
dtype: float64

## Stacking and unstacking indices

In [190]:
pop_df

                    total  under18
state      year
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [191]:
pop_df.unstack(level = 0)

           total                        under18
state California  New York     Texas California New York    Texas
year
2000    33871648  18976457  20851820    9267089  4687374  5906301
2010    37253956  19378102  25145561    9284094  4318033  6879014

In [192]:
pop_df.unstack(level = 1)

               total            under18
year            2000      2010     2000     2010
state
California  33871648  37253956  9267089  9284094
New York    18976457  19378102  4687374  4318033
Texas       20851820  25145561  5906301  6879014

In [193]:
pop_df.unstack().stack()

/tmp/ipykernel_832/1830446091.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  pop_df.unstack().stack()

                    total  under18
state      year
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [194]:
pop_df

                    total  under18
state      year
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [195]:
pop_flat = pop.reset_index(name = 'population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [196]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregations on MultiIndices

In [197]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      55.0  37.8  42.0  36.4  42.0  37.8
     2      34.0  36.6  37.0  36.2  39.0  36.4
2014 1      29.0  37.1  42.0  35.5  32.0  37.4
     2      63.0  37.3  44.0  35.4  29.0  36.3

In [202]:
data_mean = health_data.mean(level ='columns')
data_mean

TypeError: mean() got an unexpected keyword argument 'level'